ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/aes.h
/* -------- AES_RPR : (AES Offset: 0x100) Receive Pointer Register -------- */
#define AES_RPR_RXPTR_Pos 0
#define AES_RPR_RXPTR_Msk (0xffffffffu << AES_RPR_RXPTR_Pos) /**< \brief (AES_RPR) Receive Pointer Register */
#define AES_RPR_RXPTR(value) ((AES_RPR_RXPTR_Msk & ((value) << AES_RPR_RXPTR_Pos)))
/* -------- AES_RCR : (AES Offset: 0x104) Receive Counter Register -------- */
#define AES_RCR_RXCTR_Pos 0
#define AES_RCR_RXCTR_Msk (0xffffu << AES_RCR_RXCTR_Pos) /**< \brief (AES_RCR) Receive Counter Register */
#define AES_RCR_RXCTR(value) ((AES_RCR_RXCTR_Msk & ((value) << AES_RCR_RXCTR_Pos)))
/* -------- AES_TPR : (AES Offset: 0x108) Transmit Pointer Register -------- */
#define AES_TPR_TXPTR_Pos 0
#define AES_TPR_TXPTR_Msk (0xffffffffu << AES_TPR_TXPTR_Pos) /**< \brief (AES_TPR) Transmit Counter Register */
#define AES_TPR_TXPTR(value) ((AES_TPR_TXPTR_Msk & ((value) << AES_TPR_TXPTR_Pos)))
/* -------- AES_TCR : (AES Offset: 0x10C) Transmit Counter Register -------- */
#define AES_TCR_TXCTR_Pos 0
#define AES_TCR_TXCTR_Msk (0xffffu << AES_TCR_TXCTR_Pos) /**< \brief (AES_TCR) Transmit Counter Register */
#define AES_TCR_TXCTR(value) ((AES_TCR_TXCTR_Msk & ((value) << AES_TCR_TXCTR_Pos)))
/* -------- AES_RNPR : (AES Offset: 0x110) Receive Next Pointer Register -------- */
#define AES_RNPR_RXNPTR_Pos 0
#define AES_RNPR_RXNPTR_Msk (0xffffffffu << AES_RNPR_RXNPTR_Pos) /**< \brief (AES_RNPR) Receive Next Pointer */
#define AES_RNPR_RXNPTR(value) ((AES_RNPR_RXNPTR_Msk & ((value) << AES_RNPR_RXNPTR_Pos)))
/* -------- AES_RNCR : (AES Offset: 0x114) Receive Next Counter Register -------- */
#define AES_RNCR_RXNCTR_Pos 0
#define AES_RNCR_RXNCTR_Msk (0xffffu << AES_RNCR_RXNCTR_Pos) /**< \brief (AES_RNCR) Receive Next Counter */
#define AES_RNCR_RXNCTR(value) ((AES_RNCR_RXNCTR_Msk & ((value) << AES_RNCR_RXNCTR_Pos)))
/* -------- AES_TNPR : (AES Offset: 0x118) Transmit Next Pointer Register -------- */
#define AES_TNPR_TXNPTR_Pos 0
#define AES_TNPR_TXNPTR_Msk (0xffffffffu << AES_TNPR_TXNPTR_Pos) /**< \brief (AES_TNPR) Transmit Next Pointer */
#define AES_TNPR_TXNPTR(value) ((AES_TNPR_TXNPTR_Msk & ((value) << AES_TNPR_TXNPTR_Pos)))
/* -------- AES_TNCR : (AES Offset: 0x11C) Transmit Next Counter Register -------- */
#define AES_TNCR_TXNCTR_Pos 0
#define AES_TNCR_TXNCTR_Msk (0xffffu << AES_TNCR_TXNCTR_Pos) /**< \brief (AES_TNCR) Transmit Counter Next */
#define AES_TNCR_TXNCTR(value) ((AES_TNCR_TXNCTR_Msk & ((value) << AES_TNCR_TXNCTR_Pos)))
/* -------- AES_PTCR : (AES Offset: 0x120) Transfer Control Register -------- */
#define AES_PTCR_RXTEN (0x1u << 0) /**< \brief (AES_PTCR) Receiver Transfer Enable */
#define AES_PTCR_RXTDIS (0x1u << 1) /**< \brief (AES_PTCR) Receiver Transfer Disable */
#define AES_PTCR_TXTEN (0x1u << 8) /**< \brief (AES_PTCR) Transmitter Transfer Enable */
#define AES_PTCR_TXTDIS (0x1u << 9) /**< \brief (AES_PTCR) Transmitter Transfer Disable */
#define AES_PTCR_RXCBEN (0x1u << 16) /**< \brief (AES_PTCR) Receiver Circular Buffer Enable */
#define AES_PTCR_RXCBDIS (0x1u << 17) /**< \brief (AES_PTCR) Receiver Circular Buffer Disable */
#define AES_PTCR_TXCBEN (0x1u << 18) /**< \brief (AES_PTCR) Transmitter Circular Buffer Enable */
#define AES_PTCR_TXCBDIS (0x1u << 19) /**< \brief (AES_PTCR) Transmitter Circular Buffer Disable */
#define AES_PTCR_ERRCLR (0x1u << 24) /**< \brief (AES_PTCR) Transfer Bus Error Clear */
/* -------- AES_PTSR : (AES Offset: 0x124) Transfer Status Register -------- */
#define AES_PTSR_RXTEN (0x1u << 0) /**< \brief (AES_PTSR) Receiver Transfer Enable */
#define AES_PTSR_TXTEN (0x1u << 8) /**< \brief (AES_PTSR) Transmitter Transfer Enable */
#define AES_PTSR_RXCBEN (0x1u << 16) /**< \brief (AES_PTSR) Receiver Circular Buffer Enable */
#define AES_PTSR_TXCBEN (0x1u << 18) /**< \brief (AES_PTSR) Transmitter Circular Buffer Enable */
#define AES_PTSR_ERR (0x1u << 24) /**< \brief (AES_PTSR) Transfer Bus Error */
/* -------- AES_PWPMR : (AES Offset: 0x128) Write Protection Mode Register -------- */
#define AES_PWPMR_WPPTREN (0x1u << 0) /**< \brief (AES_PWPMR) Write Protection Pointer Registers Enable */
#define AES_PWPMR_WPCTREN (0x1u << 1) /**< \brief (AES_PWPMR) Write Protection Counter Registers Enable */
#define AES_PWPMR_WPCREN (0x1u << 2) /**< \brief (AES_PWPMR) Write Protection Control Register Enable */
#define AES_PWPMR_WPKEY_Pos 8
#define AES_PWPMR_WPKEY_Msk (0xffffffu << AES_PWPMR_WPKEY_Pos) /**< \brief (AES_PWPMR) Write Protection Key */
#define AES_PWPMR_WPKEY(value) ((AES_PWPMR_WPKEY_Msk & ((value) << AES_PWPMR_WPKEY_Pos)))
#define   AES_PWPMR_WPKEY_PASSWD (0x504443u << 8) /**< \brief (AES_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. */

/*@}*/


#endif /* _PIC32CX_AES_COMPONENT_ */
